	>> SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. coboltut.
AUTHOR. Colby Schexnayder.
DATE-WRITTEN. 06/10/2024.
ENVIRONMENT DIVISION.

DATA DIVISION.
FILE SECTION.

WORKING-STORAGE SECTION.
01 UserName PIC X(30) VALUE "You".
01 Num1	    PIC 9 VALUE ZEROS.
01 Num2	    PIC 9 VALUE ZEROS.
01 Total    PIC 99 VALUE 0.
01 SSNUM.
	02 SSAREA	PIC	999.
	02 SSGROUP	PIC	99.
	02 SSSERIAL	PIC	9999.
01 PIValue CONSTANT AS 3.14.
*> ZERO, ZEROES
*> SPACE SPACES
*> HIGH-VALUES
*> LOW-VALUES

PROCEDURE DIVISION.
	  DISPLAY "What is your name " WITH NO ADVANCING
	  ACCEPT UserName
	  DISPLAY "Hello " UserName

	  MOVE ZERO TO UserName
	  DISPLAY UserName
	  DISPLAY "Enter 2 values to sum "
	  ACCEPT Num1
	  ACCEPT Num2
	  COMPUTE Total = Num1 + Num2
	  DISPLAY Num1 " + " Num2 " = " Total
	  DISPLAY "Enter you social security number "
	  ACCEPT SSNum
	  DISPLAY "Area " SSAREA
STOP RUN.
